
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПерваяГруппа = "40817"; // Текуйщий счет ФЛ
	КодВалюты = "643"; // Рубль
	КодВалюты = "123456789";		

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сгенерировать(Команда)
	НомерСчета = СгенерироватьНомерСчета(ПерваяГруппа, КодВалюты, БИК);	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция СгенерироватьНомерСчета(ПерваяГруппа, КодВалюты, БИК)
		
	Если СтрДлина(ПерваяГруппа) <> 5 Тогда
		ВызватьИсключение "Первая группа счета должна состоять из 5 цифр";
	КонецЕсли;
	
	Если СтрДлина(КодВалюты) <> 3 Тогда
		ВызватьИсключение "Код валюты должна состоять из 3 цифр";
	КонецЕсли;
	
	Если СтрДлина(БИК) <> 9 Тогда
		ВызватьИсключение "БИК должен состоять из 9 цифр";
	КонецЕсли;
	
	УсловныйНомер = Прав(БИК, 3);
	Если УсловныйНомер = "000" Или УсловныйНомер = "001" Или УсловныйНомер = "002" Тогда
		// БИК РКЦ
		УсловныйНомер = "0" + Сред(БИК, 5, 2);
	КонецЕсли;
		
    ГенераторСлучайныхЧисел = Новый ГенераторСлучайныхЧисел;
    СлучайноеЧисло = "" + Формат(ГенераторСлучайныхЧисел.СлучайноеЧисло(0, 99999), "ЧГ=") + Формат(ГенераторСлучайныхЧисел.СлучайноеЧисло(0, 999999), "ЧГ="); 	
	НомерЛицевогоСчета = ПерваяГруппа + КодВалюты + "0" + ДополнитьСтроку(СлучайноеЧисло, 11);
	
	МассивВесовыхКоэффициентов = Новый Массив;
	МассивВесовыхКоэффициентов.Добавить(7);
	МассивВесовыхКоэффициентов.Добавить(1);
	МассивВесовыхКоэффициентов.Добавить(3);
	
	Коэффициент = 0;
	СуммаМладшихРазрядов = 0;
	Для Шаг = 1 По 3 Цикл
		
		ЦифраРазряда = Число(Сред(УсловныйНомер, Шаг, 1));
		
		Произведение = ЦифраРазряда * МассивВесовыхКоэффициентов.Получить(Коэффициент);
		МладшийРазряд = Произведение - Цел(Произведение/10)*10;
		СуммаМладшихРазрядов = СуммаМладшихРазрядов + МладшийРазряд;
		
		Коэффициент = Коэффициент + 1;
		Если Коэффициент = 3 Тогда
			Коэффициент = 0;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Шаг = 1 По 20 Цикл
		
		ЦифраРазряда = Число(Сред(НомерЛицевогоСчета, Шаг, 1));
		
		Произведение = ЦифраРазряда * МассивВесовыхКоэффициентов.Получить(Коэффициент);
		МладшийРазряд = Произведение - Цел(Произведение/10)*10;
		СуммаМладшихРазрядов = СуммаМладшихРазрядов + МладшийРазряд;
		
		Коэффициент = Коэффициент + 1;
		Если Коэффициент = 3 Тогда
			Коэффициент = 0;
		КонецЕсли;
		
	КонецЦикла;
	
	МладшийРазрядСуммы = СуммаМладшихРазрядов - Цел(СуммаМладшихРазрядов/10)*10;
	
	Произведение = МладшийРазрядСуммы * 3;
	
	МладшийРазряд = Произведение - Цел(Произведение/10)*10;
	
	НомерЛицевогоСчета = Лев(НомерЛицевогоСчета, 8) + Строка(МладшийРазряд) + Сред(НомерЛицевогоСчета, 10);
	
	Возврат НомерЛицевогоСчета;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ДополнитьСтроку(Знач Значение, Знач ДлинаСтроки, Знач Символ = "0", Знач Режим = "Слева")
	
	// Длина символа не должна превышать единицы.
	Символ = Лев(Символ, 1);
	
	// Удаляем крайние пробелы слева и справа строки.
	Значение = СокрЛП(Значение);
	КоличествоСимволовНадоДобавить = ДлинаСтроки - СтрДлина(Значение);
	
	Если КоличествоСимволовНадоДобавить > 0 Тогда
		
		СтрокаДляДобавления = СформироватьСтрокуСимволов(Символ, КоличествоСимволовНадоДобавить);
		Если ВРег(Режим) = "СЛЕВА" Тогда
			Значение = СтрокаДляДобавления + Значение;
		ИначеЕсли ВРег(Режим) = "СПРАВА" Тогда
			Значение = Значение + СтрокаДляДобавления;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СформироватьСтрокуСимволов(Знач Символ, Знач ДлинаСтроки)
	
	Результат = "";
	Для Счетчик = 1 По ДлинаСтроки Цикл
		Результат = Результат + Символ;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
